import java.util.Random;
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

        /**
         * Класс это шаблон по которому создается определенный объект.
         *
         * Для на на нашем этапе Класс это созданный тип данных для будущих наших нужд
         *
         * Класс это чертеж (шаблон) по которому создается объект
         *
         * Оператор new создает новый объект по шаблону и записывает его в память.
         *
         * для того чтобы обратится к классу нам нужно вызвать его по имени
         */

        User humen = new User();
        humen.age = 32;
        humen.email = "@mail.ru";
        humen.name = "Alex";
        humen.password = "123456";


        /**
         * Объектно Орентированное программирование - это механизм программирование который представляет программу
         * в качестве совокупности отдельных объектов которые взаимодействуют друг с другом.
         *
         * Основной смысл ООП это разделить программу на отдельные файлы и классы и объединить их работу в одной программы.
         *
         * ООП держится на трех столпах это 1) Наследование 2) полиморфизм 3) инкапсуляция
         *
         *
         * Задача 1
         * Склонировать мой код из моего репозитория
         * задача 2 выполнить все задачи из документа
         *
         * задача 3 Создать отдельный класс назвать его Questions и в нем в качестве коментария ответить на три
         * вопроса
         *
         */





    }


}
